/*
// ۱. تا اسم اساینمنت را دیدم یه فولدر براش ایجاد کردم. با همون اسم
// ۲. به محض دیدن اسم فایل خواسته شده روی خط فرمان ترمینال تایپ کردم: vim epur_str.c (for managing ADHD, I copypaste the names and I do not left them for later as far as I can, so I make it less probably to get stuck with my damn brain.)
// ۳. تااسم تابع رایت را دیدم در داخل ادیتور فایلی که در مرحله قبل باز کرده بودم هدر unistd.h را قرار دادم. همینجا یه دستور :w اجرا کردم که خیالم راحت بشه الان دیگه یه فایل ذهیره شده دارم که باید روش کار کنم.
# include <unistd.h>
// ۴. تازه اینجا بود که یه دور کل متن سوال را خواندم و خواسته هایش را درک کردم. (بدون اینکه جیزی بنویسم)
// ۵. دوباره برگشتم از اول خوندم. رسیدم به اونجا که گفته بود "program" تافرمت کلی مین را نوشتم
int mian()
{
		return (0);
}
// ۶. چون قبلا یه دور کل مطلب را خوانده بودم می دانستم تابع باید فقط یک ورودی آن هم از خط فرمان دریافت کنه پس پارامترهای تابع را اضافه کردم و شرط یک ورودی داشتن را اعمال کردمم
int mian(int argc, char **argv)
{
		if (argc == 2)
		{
				// باقی برنامه اینجا باید نوشته شود.
		}
		return (0);
}
//next step
int mian(int argc, char **argv)
{
		if (argc == 2)
		{
				//۷. یه نگاه کلی به متن انداختم '\n' را دیدم. می از مرور اولیه می دانستم هر اتفاقی بیفتد یک بار این کاراتر چاپ میشود ولی با پس آنرا به آعنوان آخرین خط بدنه اصلی که داخل تابع شرطی ما قرار دارد گذاشتم. ولی بعد دیدم اشتباه می کنم. چون در اینصورت وقتی شرط اعمال نشود این کاراکتر چاپ نمی شود. در حالیکه گفتیم در هر حال باید چاپ شود. پس چاپ آنرا در قبل از پایان نهایی برنامه گذاشتم.
		}
		write (1, "\n", 1);
		//قبل از ذخیره کردن متوجه شدم که دو خطای adhd دیگه هم داشتم که الان اصلاحشون کردمآخرش سمکالن نذاشته بودم و قبل از n به جای بک اسلش، ااسلش گذاشته بودم..
				// سوال: (البته من قبلا جوابشو می دونستم ولی طبق معمول یادم رفته.) چرا  "/n" آدرس کاراکتر است ؟ فرقش را با '\n' که اسکی کاراکتر است را می دانم ولی نمی دانم وقتی یک رشته در گیومه قرار می گیرد تبدیل به آدرس می شود. 
		return (0);
}
//next step حالا دیگه فرمت های اولیه تشکیل شد حالا دیگه باید بریم ببینیم حرف حساب سوال چیه؟ )یه بار هم ذخیره می کنم که تا اینجا رو داشته باشم.
int mian(int argc, char **argv)
{
		if (argc == 2)
		{
				//۸. با توجه به صورت سوال و مثالها این برنامه تنها کاری که می کنه اینه که یه عبارت یا رشته را که تب های اضافه یا اسپیس های اضافه داره را تمیز می کنه و اضافاتش را کم می کنه. نکته برای مغز معیوب! به مثالها دقت کن: یک جمله تمیز و مرتب در آخر جمله اگر قرار باشه نقطه بگذاریم قبل از نقطه اسپیس نمیذاریم ولی اینجا با اون نقطه ی آخر هم مثل یک کلمه رفتار کرده. نشینی تا آخر امتحان بزنی تو سر خودت که اگه آخرش نقطه بود چطوری بچسبونم به ته جمله. نقطه هم مثل بقیه کارکتر ها هست. تو فقط و فقط با تب و اسپیس کار داری. البته ابتدا انتها هم مهمه ولی دیگه کوچیک و بزرگ بودن حروف یا کارکتر عجیب و غریب بودن شون به تو ربطی ندارد! با این حساب معلوم میشه ما با دو تا حرکت اصلی کار داریم یکی حرکت روی رشته و دومی دومی مقایسه. حرکت روی رشته یعنی لوپ و مقایسه هم یعنی شرط پس قالب کلی را بنا می کنیم (بعدا ممکنه لازم بشه تغییرش بدیم ولی فعلا یه گل خام میذاریم روی چرخ کوزه گری تا بعد ببینیم چه کوزه ای میشه باهاش ساخت. )چه گلی به سرمون بگیریم)
			while ()
			{
					if()
					{
							// یه کاری بکن
					}
					write (1, &c, 1);
							//یکی برو جلو 
			}

		}
		write (1, "\n", 1);
		return (0);
}
// Next step
// ۹. متغیر ورودی اصلی ما یک رشته هست که از خط فرمان می گیریم.
// همینجا یه سوال مفهومی برای من پیش اومد. متغیر ورودی ما یک ماتریس دو بعدی است که یک بعد آن شماره ی جایگاه متغیر (اولی مال آدرس خود فرمان هست) را تعیین می کند و دومی مثل بقیه ی متغیر ها رشته را. من می دونم که **argv و *argv[] و argv[][]... هیچی ولش کن. روی کاغذ کشیدم فکر کنم خودم جوابمو گرفتم. بر می گردم به حل مسئله. 
int mian(int argc, char **argv)
{
		if (argc == 2)
		{
// ۱۰ شرط حلقه ما اینست که به آیا کارکتری از رشته باقی مانده یا نه. 
			while (argv[1][i] != '\0')
					// 11.  یه متغیر جدید وارد کردیم باید بریم تعریف و مقداردهی اولیه کنیم. 
			{
					if()
					{
							// یه کاری بکن
					}
					write (1, &c, 1);
							//یکی برو جلو 
			}

		}
		write (1, "\n", 1);
		return (0);
}


int mian(int argc, char **argv)
{
		int i;
		
		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] != '\0')
			{
					// ۱۲. شرط مقایسه. کافیه اول داستان ببینیم اسپیس یا تب هست یا نه. مغز معیوب عزیز حفظ کردن براش سخته تازه احتمال اشتباه کردن هم داره پس باید برای جلسه امتحان ساده ترین شیوه ها رو بکار ببره. بنابراین به جای استفاده از کد اسکی از کاراکتر داخل کوتیشن استفاده می کنه.
					if(argv[1][i] != ' ' || argv[1][i] != '\t')
					{
							// ۱۳. چاپش کن یکی برو جلو (فعلا هنوز گل خام هست باید ببینیم برای بقیه مسیر می خواهیم چه کنیم شاید بیایم منطقشو یه کمی عوض کنیم. )
					write (1, arg[1][i], 1);
					i++;
					}
							//یکی برو جلو 
			}

		}
		write (1, "\n", 1);
		return (0);
}
// یا اصلا یه کار دیگه! ما میایم اول برنامه را برای یه نمونه ساده می نویسیم بعد هی شرایط صورت مسئله را بهش اضافه می کنیم بهبودش میدیم. مثلا از این شروع می کنیم: "Delam baraye pesaram keiiiili tang shodeh. Namarda bachamo grogan gereftan."
							//
int mian(int argc, char **argv)
{
		int i;
		
		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] != '\0')
			{
				// ۱۴. مسیر ذهنم را فعلا روی گل بازی جدید تنظیم می کنم یه ذره منطق را عوض می کنم.	
					if(argv[1][i] == ' ' || argv[1][i] == '\t')
					{
							//اول کار اگه از این کاراکتر ها دیدی محل سگ هم بهشون نذار فقط برو جلو... خب یه چیزی! این توی شرط هست. اگه چن د تا از اینا بود چی؟ حلقه! این اول بازیه چرا مثل همون مثالی که تو atoi داشتیم اینو نبریم توی اول بازی.؟ پس می بریمش بلا
							i++;
					}
					write (1, arg[1][i], 1);
					i++;
					}
							//یکی برو جلو 
			}

		}
		write (1, "\n", 1);
		return (0);
}


int mian(int argc, char **argv)
{
		int i;
		
		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] == ' ' || argv[1][i] == '\t')
					i++;
// ۱۵. از حلقه فوق که بیرون اومد فقط باید چک کنیم چیزی باقی مونده یا نه. اگر مونده بود هرچی بود چاپش کن یکی برو جلو. تا میگیم یکی برو جلو باید گوشمون زنگ بخوره یه حلقه دور و برش هست (معمولا. گاهی فقط یه بار میره و با یه شرط سر و ته قضیه هم میاد. ولی اینجا ما می دانیم اون قصه ی من سر دراز دارد. نقل یک خیانته ! بگذریم منظور اینه که رشته طولانیه و همون حلقه را لازم داریم)
	
			while (argv[1][i] != '\0')
			{
					write (1, arg[1][i], 1);
					// i++;
					// آهان! فکر کنم افتاد! (میدونی اصطلاح افتاد از کجا اومده؟) نکته همینجاست!! تتا کجا باید بریم جلو؟ تا جایی که بخوریم بکی از اون دوتا کارکتر. اگه به هرکدوم خوردیم یه اسپس چاپ می کنیم اصل نکته اینجاست! اینجا اگه قرار باشه برگردیم بالای همین حلق و دوباره اسپسی یا تب باشه که باز چاپش میکنه چطوری متوقفش کنیم؟ اینجا باید اگر اسپیس چاپ کردیم بریم سراغ همون حلقه ای که که بردیم بیرون. ممکنه بشه دوتا یکی کرد ولی مطمئن نیستم فعلا تو رحله گل بازی همینی که فهمیدیم را بذار ببینم چطوری  پیاده کنم. 
					// فعلا به نظرم راهش اینه که تله را بذاریم اول همین  حلقه ... نه نمیشه فعلا ساده ترش میکنیم اول بذار چک کنیم ببینیم اصلا اینی که چاپ کردیم اسپیس بوده یا نه؟ چون ممکنه تب هم بوده باشه ما برای سادگی دوتا یکی می کنیم میگیم چه تب بود چه اسپیس تو همونجا یه اسپیس چاپ کن. قبل از اینکه یکی بری جلو.
					if (argv[1][i] == ' ' || argv[1][i] == '\t')
							write (1, ' ', 1);
					// بعدش یکی برو جلو.
					i++; 
					// توی این مرحله گل بازی چون داریم برای حالت ساده تر انجام میدیم فرض می کنیم الکی مثلا ما حواسمون نیست کاراکتر بعدی ممکنه بازم اسپیس یا تب باشه. فعلا بر میگرده دوباره بالای همین حقله تا مرحله بعد ببینیم حواسمون که جمع شد و گفتی م اِ!شیاد بعدش باز تب باشه و یا اسپیس باشه چه خاکی توی سرمون بریزیم؟ پس بریم برای مرحله بعد. 

			}

		}
		write (1, "\n", 1);
		return (0);
}


int mian(int argc, char **argv)
{
		int i;
		int flag;

		flag = 0;
		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] == ' ' || argv[1][i] == '\t')
					i++;
			while (argv[1][i] != '\0')
			{
					write (1, arg[1][i], 1);
					if ((argv[1][i] == ' ' || argv[1][i] == '\t') && flag = 0)
					{
							write (1, ' ', 1);
							flag = 1;
					}
					i++
		// ۱۶. دارم فکر می کنم شاید بشه با یه فلگ سرو ته قضیه را هم آورد. میرم یه امتحانی بکنم ببینم چی از آب در میاد.			
			}

		}
		write (1, "\n", 1);
		return (0);
}



		// ۱۷. اول فلگ را ساده گذاشتم دیدم به هزار جور مشکل میخوره دیگه اونا رو ننوشتم ولی یه سری تغییرات که همینجا می بینی دادم ببینم میشه از فلگ کار کشید یا نه. اگه نشد کلا منطقمو تو مرحله ی بعد عوض میکنم.
int mian(int argc, char **argv)
{
		int i;
		//int flag;

		//فکر کنم ایده ی فلگ فقط وقتمو توی امتحان تلف کرد. شاید با یه حلقه خالی کار راه بیفته. ولی چون ایده فلگ را تا تهش نرفتم حذفش نمی کنم فعلا کامنتش می کنم. 
		//flag = 0;
		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] == ' ' || argv[1][i] == '\t')
					i++;
			while (argv[1][i] != '\0')
			{
					write (1, arg[1][i], 1);
					if (argv[1][i] == ' ' || argv[1][i] == '\t')
					{
							write (1, ' ', 1);
							i++;
							while (argv[1][i] == ' ' || argv[1][i] == '\t')
									i++;

						//	flag = 1;
					}
					// اینجابرنامه را که توی ذهنم اجرا می کنم میبینم که اگر بین دو لغت فقط یه اسپیس باشه دوبار میره جلو . از طرفی اگر اصلا هیچ اسپیسی توی کل رشته نباشه یه اینجا یهو دوتا میپره. خب دوتا بپره چه اشکالی داره؟ اشکالش اینه که فرض کن توی جمله فرضی اینطوری داشته باشیم "...tan n n n  ng shode..." برسه به اون دوتا اسپیس پشت سر هم سوتی میده. پس فعلا کامنتش می کنم ببینم برای یه رشته ی بدون اسپیس کجا باید حلقه را درست بچرخونم.
					//i++
			}

		}
		write (1, "\n", 1);
		return (0);
}

// فکر کنم فهمیدم! بعد از رایت کردن اسپیس یه خونه جلو رفتن را میسپریم به حلقه. اگر یه دونه اسپیس باشه حلقه یه خونه میره جلو . البته هنوز یه مشکل دارم باید فکر کنم ببینم اگه از  ایف بیاد بیرون چی میشه یا از حلقه. 
int mian(int argc, char **argv)
{
		int i;
		//int flag;

		//flag = 0;
		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] == ' ' || argv[1][i] == '\t')
					i++;
			while (argv[1][i] != '\0')
			{
					write (1, arg[1][i], 1);
					if (argv[1][i] == ' ' || argv[1][i] == '\t')
					{
							write (1, ' ', 1);
							while (argv[1][i] == ' ' || argv[1][i] == '\t')
									i++;

						//	flag = 1;
					}
					//i++
			}

		}
		write (1, "\n", 1);
		return (0);
}



// ایده ای که الان به ذهنم میرسه یه کم به نظرم کثافت کاریه . ولی من همیشه همینطوری مغزم کار میکنه توی تونلی که رفته فرو میره و حتی اگه بیاد بیرون ایده دیگه ای به ذهنم معمولا نمیرسه و همش فکرم بدون کنترل میره سمت ادامه دادن همون ایده. معمولا هم دقیقا در همچین مسیری وقت کل امتحان را از دست میده البته فکر کنم درستش هم همینه. این یعنی من جوابو بلد نیستم و دارم زور میزنم سر جلسه حلش کنم. حالا با امتحان کردن ایده های مختلف ممکنه وقت تموم بشه و جوابو پیدا نکنم و ممکن هم هست که اون وسطا به جواب برسم. فقط در صرورتی میشه امیدوار بود که سر راست به جواب برسم (چیزی که در وقت امتحان بگنجه اینه که از قبل بلد باشی یا مشابهشو حل کرده باشی. بگذریم بریم سر کثافت کاری:
int mian(int argc, char **argv)
{
		int i;
		//int flag;

		//flag = 0;
		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] == ' ' || argv[1][i] == '\t')
					i++;
			while (argv[1][i] != '\0')
			{
					write (1, arg[1][i], 1);
					if (argv[1][i] == ' ' || argv[1][i] == '\t')
					{
							write (1, ' ', 1);
							while (argv[1][i] == ' ' || argv[1][i] == '\t')
									i++;

						//	flag = 1;
					}
					//اومدم کثافت کاریه را بنویسم (میخواستم یه شرط جدید بذارم که اگه رفته بود توی شرط بالایی دیگه اضافه نکن وگرنه اضافه کن.  یهو به ذهنم رسید خب این یعنی همون else  دیگه! یه else بذارم خیلی هم کثافتکاری نیست. امتحان می کنم.
					else
							i++;
					// اینجوری »یا« توی ایف جلو میره »یا« توی الس.
					// برم کامنتارو پاک کنم ببینم چی از آب در اومد.
			}

		}
		write (1, "\n", 1);
		return (0);
}


# include <unistd.h>

int mian(int argc, char **argv)
{
		int i;

		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] == ' ' || argv[1][i] == '\t')
					i++;
			while (argv[1][i] != '\0')
			{
					write (1, &argv[1][i], 1);
					if (argv[1][i] == ' ' || argv[1][i] == '\t')
					{
							write (1, " ", 1);
							while (argv[1][i] == ' ' || argv[1][i] == '\t')
									i++;
					}
					else
							i++;
			}

		}
		write (1, "\n", 1);
		return (0);
}

// همینطوری نگاه می کنم مشکل خاصی به نظرم نمیرسه برم یه بار کامپایل کنم 
// منطق کلی من این بوده
// ۱. اول رشته هرچی تب و اسپیس داری رد کن
// ۲. حالا که اونا رو رد کردی اگر هنوز چیزی باقی مونده چاپش کن. و تا وقتی دوباره به اسپیس یا تب نرسیدی انقدر چاپ کن که چیزی نمونه
// ۳. هرجا به اسپیس یا تب رسیدی یه اسپیس بذار و با یه حلقه شبیه اول کار بقیه را رد کن تا به کاراکتر غیر اسپیس یا تب برسی
// ۴. اگر به کاراکتر غیر اسپیس یا تب رسیدی از حلق و شرط بیا بیرون بره اول حلقه بیرونی که چک کنه اونی که تو ازش اومدی بیرون آخر قصه بوده یا ادامه داره. اگه آخرش بود که یه خط خالی چاپ می کنه و تامام! اگر نه باز بازی را ادامه میده. 
// بریم واسه کامپایل.
// هنوز کامپایل نکرده یه سری سوتیهای مسخره همین موقع سیو کردن زد بیرون. البته من پلاگین روی ادیتورم دارم وگرنه تو امتحان اینجا بیرون نمیزد(یادم نست کدوم پلاگین و کی نصب کردم)
//سوتی اوم که خیلی ضایع هست اینه که به تابع رایت گفتم اسکی اسپیس را بنویس یعنی به جای یعنی به جای رشته (که توسط آدرس مشخص میشه و رایت هم آدرس نیاز داره نه اسکی کارکتر یا خود کارکتر) من اسکی شو دادم. که اصلاح کردم. 

// اما سوتی دومم یه کم ریشه در درک و فهم دقیق پوینتر های چند بعدی داره و فقط از روی تجربه می دونم باید به جای خود عضو آرایه آدرسشو بدم پس یه & قبلش میذارم. 
// گذاشتم ولی قبل از اینکه ذخیره کنم دیدم داره پیغام میده من این متغیر را تا حالا ندیدم. دقت کردم دید به جای argv  نوشتم arg. درستش کردم دوباره سیو کردم.
// اینبار داره هشدار cast  بهم میده. یعنی مشکل اسکی و آنسایند و اسکی منفی و اینا داره؟ به نظرم به جز اون غلط تایپی باید امپرساند را هم قبلش بذارم. 
// آره. لااقل تو مرحله سیو کردن ایراد نگرفت. ببین! قشنگ تابلو هست که من تو فهم این آدرس ها و پوینتر ها و آرایه های بیش از یک بعد لنگ میزنم. اینو دیگه تابلو سعی و خطایی رفتم.
// دیگه بریم برای کامپایل 
//
// بیا کامپایل کردم باز سوتی مسخره

 * ➜  github cd epur_str
➜  epur_str git:(main) ls
README.md
➜  epur_str git:(main) ls
epur_str.c  README.md
➜  epur_str git:(main) ✗ gcc -Wall -Wextra -Werror epur_str.c -o epur_str
/usr/bin/ld: /usr/lib/gcc/x86_64-linux-gnu/10/../../../x86_64-linux-gnu/Scrt1.o: in function `_start':
(.text+0x1b): undefined reference to `main'
collect2: error: ld returned 1 exit status
➜  epur_str git:(main) ✗
// نمن که راستش مفهوم ارورشو نفهمیدم ولی دوباره به کدم نگاه کردم دیدم به جای main نوشتم mian!!!
# include <unistd.h>

int main(int argc, char **argv)
{
		int i;

		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] == ' ' || argv[1][i] == '\t')
					i++;
			while (argv[1][i] != '\0')
			{
					write (1, &argv[1][i], 1);
					if (argv[1][i] == ' ' || argv[1][i] == '\t')
					{
							write (1, " ", 1);
							while (argv[1][i] == ' ' || argv[1][i] == '\t')
									i++;
					}
					else
							i++;
			}

		}
		write (1, "\n", 1);
		return (0);
}

// به تست دوم نرسید. همین اول کاری معلوم شد منطق ایراد داره 
// ➜  epur_str git:(main) ✗ gcc -Wall -Wextra -Werror epur_str.c -o epur_str
➜  epur_str git:(main) ✗ ./epur_str "See? It's easy to print the same thing" | cat -e
See?  It's  easy  to  print  the  same  thing$
➜  epur_str git:(main) ✗
کف کردم میرم یه قهوه بخورم میام چکش می کنم تو فعلا تا همینجا رو بخون ساعت هم نگاه کن ببین من چقدر وقت گذاشتم . کل امتحان ۳ ساعته!!!
فقط هیچی نگو ها! حتی یک کلمه . فقط اجازه داری بگی «خوندم» نه راهنمایی نه افرین. نه خوب نه بد. فکر کن من هنوز سر جلسه هستم و بیرون نیومدم. دارم میفرستم که فقط بخونی. بعد که خودم برگشتم میخوام اشکالمو پیدا کنم. اگه نتونستم خودم ازت می پرسم. 

# include <unistd.h>

int main(int argc, char **argv)
{
		int i;

		i = 0;
		if (argc == 2)
		{
			while (argv[1][i] == ' ' || argv[1][i] == '\t')
					i++;
			write (1, &argv[1][i], 1);
//			while (argv[1][i] != '\0')
//			{
//					write (1, &argv[1][i], 1);
//					if (argv[1][i] == ' ' || argv[1][i] == '\t')
//					{
//							write (1, " ", 1);
//							while (argv[1][i] == ' ' || argv[1][i] == '\t')
//									i++;
//					}
//					else
//							i++;
			}


		}
		write (1, "\n", 1);
		return (0);
}
// صحت کارکرد حلقه اول را (همینطوی یه تست کوچیک نه کامل) اینجوری تست با تغییرات بالا تست کردم که ظاهرا مشکل نداره نتیجه این بود:
// ➜  epur_str git:(main) ✗ ./epur_str " this        time it      will     be    more complex  . " | cat -e
//t$
//➜  epur_str git:(main) ✗

# include <unistd.h>

int main(int argc, char **argv)
{
        int i;

        i = 0;
        if (argc == 2)
        { 
            while (argv[1][i] == ' ' || argv[1][i] == '\t')
                    i++;
			// آهان فکر کنم پیداش کردم اینجاست! رسیده به اسپیس شرط برقرار شده ردش نکرده بعد ما بهش گفتیم همینو بنویس خب اون بدبختم همونو نوشته دیگه! پس باید چیکار کنیم؟ ما در هر حال قبل از نوشتن باید از روی اسپیس بپریم. پس تابع رایت را میبریم زیر شرط حلقه زیر اینجوری از حلقه بیاد بیرون چه یه دونه باشه چه ده تاکاراکتر بعدش هم می نویسه. ولی صبر کن. اینجوری بره توی حلقه ما حتی اسپیس یه دونه ای راهم از دست میدیم. صبر کن ببینم چرا گیج شدم.آهان! مشکل اون نیست. مشکل توی حلقه هست. اسپیس را یه بار بیرون حلقه اول می نویسه و بعد بدون اینکه ازش رد  بشه توی حلقه دوباره می نویسه و بعدش ازش رد میشه ولی نه. اینم نیست من همون اول به این فکر کردم. داخل حلقه ی دوم (اگر کاراکتری باقیمانده باشه) قطعا اون کاراکتر دیگه تب یا اسپیس نیست چون حلقه اول همرو رد کرده.اصلا یه فکر دیگه. یه بار امتحان کنم ببینم اگر حلقه اول و دوم را یکی کنم چی میشه؟الان حلقه اول را کامنت می کنم و ترتیب کلش را عوض می کنم اگه خیلی پرت و پلا شد برمیگردم یه راه دیگه میرم. نه مثل اینکه پرت و پلا شد و پیچیده تر شد. اون اول داستان را با همون حلقه خودش رد می کنیم. اونو بر می گردونم سر جاش میام سر حلقه پایینی. 
			while (argv[1][i] != '\0')
            {
                    if (argv[1][i] == ' ' || argv[1][i] == '\t')
                    {
                            while (argv[1][i] == ' ' || argv[1][i] == '\t')
                                    i++;
                            write (1, " ", 1);
                    }
                    else
					{
							// آهان شاید گیر اینجاست. اون کاراکتر اول بعد از حلقه ی اول که می دونیم اسپیس یا تب نیست خوب تو شرط بالا نمیره. اینجا اول می نویسیمش بعد یکی جلو میریم و میریم اول حلقع. فکر کنم این جواب میده بذار امتحان کنم.
                    		write (1, &argv[1][i], 1);
                            i++;
					}

            }
//الان باید درست شده باشه. اول که همهی اسپیس و تب ها رو رد می کنه. میاد تو حلقه دوم. یقینان توی ایف نمیره میره داخل الس و کاراکتر را می نویسه و یکی میره جلو. بعد میره اول حلقه حالا اگر اسپیس یا تب نوبد که باز همون داستانه ولی اگه بود هرچی اسپیس یا تب هست رارد می کنه و قبل از خروج از ایف یه اسپیس میذاره. چون توی ایف رفته اصلا توی الس نمیره. برمیگرده اول حلقه. الان یدگه میدونیم قبلا همه اسپیس و تب ها رو رد کرده این اسپیسی هم که چاپ کرده ربطی به ورودی نداره. روی رشته ورودی دوباره قطعا اسپیس یا تب نیست. باز میره توی الس و همینطوری تا آخ. به آخرین کارکتر که رسید دیگه وایل نمیذاره وارد شه و هیچی تای نمیشه. . یخ حط خالی و تامام! آره ارواح خیک عمت! تامام!!! اگه آخرین کاراکتر اسپیس بود چی؟ ما تهش هم نباید اسپیس داشته باشیم. اون اسپیس رو میبینه و لااقل یه دونه اسپیس چاپ می کنه. عجب گرفتاری شدیماااا! خب بذار ببینم چه خاکی تو سرم کنم. ما باید قبل از نوشتن اون یه دونه اسپیسی که بعد از حلقه ی رد کردن اسپیس ها و تب ها توی لوپ دوم هس ت اول مطپئن شیم این آخرین اسپیس نیست. یه راه به ذهنم میرسه ولی باز به نظرم کثافتکاریه. ممکنه جواب بده ولی احتمالا راه تمیزی نیست. امتحان می کنم. می دونی قصد دارم چیکار کنم؟ قبل نوشتن اون یه دونه اسپیس چک کنم ببینم آیا کاراکتر بعدیش نال هست یا نه. چون توی رشته آخرین کاراکتر نال هست. اگر کاراکتر بعدیش نال باشه اون یه دونه اسپیس که خودمون دستی همیشه چاپ می کنیم را چاپ نمی کنیم. اینو بذار تست کنم. 

        } 
        write (1, "\n", 1);
        return (0);
}


# include <unistd.h>

int main(int argc, char **argv)
{
        int i;

        i = 0;
        if (argc == 2)
        {
            while (argv[1][i] == ' ' || argv[1][i] == '\t')
                    i++;
            while (argv[1][i] != '\0')
            {
                    if (argv[1][i] == ' ' || argv[1][i] == '\t')
                    {
                            while (argv[1][i] == ' ' || argv[1][i] == '\t')
                                    i++;
							if (argv[1][i+1] != '\0')
									write (1, " ", 1);
                    }
                    else
                    {
                            write (1, &argv[1][i], 1);
                            i++;
                    }

            }
        }
        write (1, "\n", 1);
        return (0);
}
// میرم واسه کامپایل این بالایی.
// ➜  epur_str git:(main) ✗ gcc -Wall -Wextra -Werror epur_str.c -o epur_str
//➜  epur_str git:(main) ✗ ./epur_str "See? It's easy to print the same thing" | cat -e
//See? It's easy to print the same thing$
// خب رو اولی که کار کرد.
//➜  epur_str git:(main) ✗ ./epur_str " this        time it      will     be    more complex  . " | cat -e
//this time it will be more complex . $
// اِ! خاک تو سرش چرا باز درست کار نکرد؟ باز بعد از نقطه اسپیس گذاشت!
// آهاااااان فکر کنم فهمیدم. حلقه وقتی اسپیس و تب را رد می کنه قبلش به کاراکتر بعد از خودش رسیده. دیگه لازم نیست یه بار دیگه من یکی دیگه دستی ببرم جلو و چک کنم. چقدر کم خردم وجدانا ! یه بار دیگه!


*/

# include <unistd.h>

int main(int argc, char **argv)
{
        int i;

        i = 0;
        if (argc == 2)
        {
            while (argv[1][i] == ' ' || argv[1][i] == '\t')
                    i++;
            while (argv[1][i] != '\0')
            {
                    if (argv[1][i] == ' ' || argv[1][i] == '\t')
                    {
                            while (argv[1][i] == ' ' || argv[1][i] == '\t')
                                    i++;
                            if (argv[1][i] != '\0')
                                    write (1, " ", 1);
                    }
                    else
                    {
                            write (1, &argv[1][i], 1);
                            i++;
                    }

            }
        }
        write (1, "\n", 1);
        return (0);
}
// برای هزارمین بار میریم که فکر کنیم این آخرین باره که کامپایل می کنیم.
/*
 * ➜  epur_str git:(main) ✗ ./epur_str "See? It's easy to print the same thing" | cat -e
See? It's easy to print the same thing$
اولین تست که ساده بود شد. قبلا هم میشد. هنر نکرده. بریم تست دوم.
➜  epur_str git:(main) ✗ ./epur_str " this        time it      will     be    more complex  . " | cat -e
this time it will be more complex .$
ایول! دومی هم شد! اون دوتای بعدی هم که اصلا همون اوایل که داشتم شبه کد مینوشتم معلوم بود که میشه. همون شرط argc == 2 اول و رایت کردن یه خط خلی آخر کارشو میسازه. با اینحال تست می کنم. که خیلی مطئن شم. چون از من بعید نیست همونجا هم سوتی داده باشم.
➜  epur_str git:(main) ✗ ./epur_str "No S*** Sherlock..." "nAw S*** ShErLaWQ..." | cat -e
$
➜  epur_str git:(main) ✗ ./epur_str "" | cat -e
$
➜  epur_str git:(main) ✗
بالاخره فلان غول رو شکوندیم (وقتی میخوان یکی مسخره کنند اونم در حد جمع رفقای نزدیک به جای شاخ غول یه جای دیگه غول رو میگن)
بعد از یه روز کار تازه ۴ تا خط برنامه نوشتم. واقعا خسته نباشم! 
تازه اونم اگه الان تو نگی چشش چپه گوشش راسته!
شروع نکنی ازم تعریف کردن ها! بیشتر لجم در میاد.! اونوقت تو میگی به امتحان میرسیم تا سطح ۴ بخونیم. بیا کل امروز فقط یه مثال ۴ خطی!!!
*/



